Revit 2027 API
BuiltInFailures.EditingFailures.CannotMoveLocked Property
 Can't move pinned element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveLocked { get; }
Public Shared ReadOnly Property CannotMoveLocked As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveLocked {
	FailureDefinitionId^ get ();
}
static member CannotMoveLocked : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace